package com.example.eyetech;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.content.SharedPreferences;
import android.os.Bundle;
import android.view.animation.AnimationUtils;
import android.widget.ImageView;
import android.widget.TextView;

public class MainActivity extends AppCompatActivity {
    MyDbHelper myDbHelper;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

            myDbHelper = new MyDbHelper(MainActivity.this);
/*        myDbHelper.addItem("الباروميتر المعدني",
                "عبارة عن علبة معدنية مستديرة من النيكل والفضة مفرغة تماما من الهواء فإذا زاد الضغط يضغط على السطح المموج للعلبة المفرغة فتنخفض سطح العلبة وينخفض معه الساق والرافعة فيتحرك المحور والمؤشر المتصل به حركة دائرية أمام الدائرة المدرجة ليعطى قيمة الضغط, وإذا قل الضغط يرتفع سطح العلبة فيرتفع معه الساق والرافعة فيتحرك المحور والمؤشر حركة دائرية فى عكس الاتجاه السابق.\n" +
                        "\n" +
                        "* وظيفته الرئيسية:  تسجيل الضغط الجوي عند مستوى " +
                        "البحر."
                , R.drawable.cat10, 1);*/

            myDbHelper.addItem("تركيب سنترالات الباناسونيك الحديثة", "التواصل الناجح هو جوهر الأعمال اليومية داخل الشركات و المؤسسات. تم تصميم سنترالات الهاتف لزيادة التحكم بالمكالمات الصادرة و الواردة مع آلية تبسيط العمل بالإضافة إلى توفير الإتصال الداخلي بين موظفي الشركة. نحن نهدف إلى تحسين وسيلة التواصل بين جميع موظفي الشركة  وعملائها بطريقة سلسة وسهلة و ذلك بتقديم أنظمة سهلة الاستخدام وذات تقنيات متعددة.", R.drawable.service1, 1);
            myDbHelper.addItem("إعداد وتجهيز غرف السيرفر", "يتميز عالم الأعمال بوتيرة سريعة تتطلب من الشركة إدارة وتخزين كم هائل من البيانات. إن عملية بناء البنية التحتية لفرف السيرفر هي العمود الفقري لمركز البيانات الخاصة بالشركة. تقدم الشركة مجموعة واسعة من الحلول المتكاملة تشمل تصميم و إعداد و تجهيز غرف السيرفر و تمديد الكوابل الخاصة بها بطريقة تتناسب مع إحتياجات الشركة.", R.drawable.service2, 1);
            myDbHelper.addItem("توريد و تركيب شبكات الكمبيوتر والإنترنت", "تتميز بيئة العمل اليومية بدرجة عالية من النشاط والحيوية بحيث تتطلب تبادل كمية هائلة من المعلومات بصورة سريعة لضمان الوصول الى أعلى درجة من الكفاءة والإنتاجية في العمل. أصبح توفير أفضل الحلول التقنية وأكثرها تطورا في بناء وتمديد شبكات الكمبيوتر والانترنت السلكية و اللاسلكية من أهم الأولويات التي تتصدر إهتمام كبار الشركات و رجال الأعمال. مهمتنا تتركز في توفير أفضل التكنولوجيا و أكثرها فعالية في رفع مستوى أداء الشبكة لديك.", R.drawable.service3, 1);
            myDbHelper.addItem("تأجير أنظمة الاتصال المرئي", "تواجه الشركات والمؤسسات التجارية و الدولية مجموعة من التحديات الخاصة و التي تؤثر على آلية تنفيذ و إتمام المشاريع الخاصة بها في الأوقات المحددة. توفر الأنظمة الخاصة بشركة EyeTech خاصية الإتصال المرئي (Video Conference) بكفاءة عالية بحيث تمكن فريق العمل من التواصل مع الشركات و المؤسسات عن بعد بالاعتماد على أعلى درجات الجودة في نقل الصوت والصورة. يمكنك الاعتماد على خدمة الاتصال المرئي لربط المقرات وعقد الاجتماعات بتقنية عالية توفر لك الوقت و الجهد.", R.drawable.service4, 1);
            myDbHelper.addItem("أنظمة كوابل الألياف الضوئية", "تدرك كبرى الشركات و المؤسسات حاجتها للحصول على أعلى جودة في أنظمة التواصل عبر الانترنت وخصوصا في مجال الاتصال المرئي. أثبتت كوابل الألياف الضوئية (Fiber Optics) قدرة عالية على تحسين جودة و أداء شبكة الانترنت عن طريق كمية هائلة من البيانات بسرعة تكاد تكون ملحوظة.", R.drawable.service5, 1);
            myDbHelper.addItem("صيانة أجهزة ال UPS و الأجهزة الإلكترونية", "تجاوبا مع إحتياجات السوق المحلي و رغبةً منا في تلبية كافة احتياجات عملائنا فقد تم تطوير القسم الخاص بالدعم الفني ليكون قادرا على صيانة جميع الأعطال الخاصة بأجهزة الطاقة الكهربائية UPS . تتميز الشركة بقدتها على صيانة و برمجة مجموعة واسعة من أجهزة ال UPS ذات العلامات التجارية.", R.drawable.service6, 1);

//            myDbHelper.addItem("TES824 - نظام الباناسونيك", "نظام TES824 و الذي يتميز بقدرته على تأمين الدعم الكامل لجميع الإحتياجات التي تتعلق بالإتصالات الخاصة بالشركة .حيث يوفر هذا النظام مجموعة من المميزات التي تلبي جميع متطلبات المستخدمين .سوف يمكنك الجهازمن ربط مجموعة مختلفة من أجهزة الإتصالات مثل الهواتف اللاسلكية وأجهزة الرد آلي وأجهزة الإنترنت وبطاقة الإئتمان و أجهزة الفاكس وغيرها من الاجهزة التي تعمل مع خطوط الهاتف التقليدية.", R.drawable.cat3, 2);

        ImageView imageView = findViewById(R.id.imageView1);
        TextView textView = findViewById(R.id.textView);

        imageView.startAnimation(AnimationUtils.loadAnimation(this, R.anim.fromtop));
        textView.startAnimation(AnimationUtils.loadAnimation(this, R.anim.frombottom));

        new Thread(() -> {
            try {
                Thread.sleep(5000);
                startActivity(new Intent(MainActivity.this, HomeActivity.class));
            } catch (InterruptedException e) {
                e.printStackTrace();
            }
        }).start();

    }
}